In [23]:
import pandas as pd

In [24]:
dataframe = pd.DataFrame({
    "id": [7058, 4511, 7014, 7033, 1234],
    "name": ["sravan", "manoj", "aditya", "bhanu", "manoj"],
    "Maths_marks": [99, 97, 88, 90, 60],
    "Chemistry_marks": [89, 99, 99, 90, 50],
    "telugu_marks": [99, 97, 88, 80, 100],
    "hindi_marks": [99, 97, 56, 67, 90],
    "social_marks": [79, 97, 78, 90, 97],
})
dataframe

,id,name,Maths_marks,Chemistry_marks,telugu_marks,hindi_marks,social_marks
0,7058,sravan,99,89,99,99,79
1,4511,manoj,97,99,97,97,97
2,7014,aditya,88,99,88,56,78
3,7033,bhanu,90,90,80,67,90
4,1234,manoj,60,50,100,90,97

In [25]:
dataframe.describe()

,id,Maths_marks,Chemistry_marks,telugu_marks,hindi_marks,social_marks
count,5.000000,5.000000,5.000000,5.00000,5.000000,5.000000
mean,5370.000000,86.800000,85.400000,92.80000,81.800000,88.200000
std,2557.441397,15.674821,20.354361,8.58487,19.227584,9.311283
min,1234.000000,60.000000,50.000000,80.00000,56.000000,78.000000
25%,4511.000000,88.000000,89.000000,88.00000,67.000000,79.000000
50%,7014.000000,90.000000,90.000000,97.00000,90.000000,90.000000
75%,7033.000000,97.000000,99.000000,99.00000,97.000000,97.000000
max,7058.000000,99.000000,99.000000,100.00000,99.000000,97.000000

In [26]:
dataframe["Maths_marks"].unique()

array([99, 97, 88, 90, 60])

In [27]:
dataframe["Maths_marks"].nunique()

5

In [28]:
dataframe.columns

Index(['id', 'name', 'Maths_marks', 'Chemistry_marks', 'telugu_marks',
       'hindi_marks', 'social_marks'],
      dtype='object')

In [29]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               5 non-null      int64
 1   name             5 non-null      object
 2   Maths_marks      5 non-null      int64
 3   Chemistry_marks  5 non-null      int64
 4   telugu_marks     5 non-null      int64
 5   hindi_marks      5 non-null      int64
 6   social_marks     5 non-null      int64
dtypes: int64(6), object(1)
memory usage: 412.0+ bytes

In [30]:
dataframe.min()

id                   1234
name               aditya
Maths_marks            60
Chemistry_marks        50
telugu_marks           80
hindi_marks            56
social_marks           78
dtype: object

In [31]:
dataframe["Maths_marks"].min()

60

In [32]:
dataframe.max()

id                   7058
name               sravan
Maths_marks            99
Chemistry_marks        99
telugu_marks          100
hindi_marks            99
social_marks           97
dtype: object

In [33]:
dataframe.sum()

id                                       26850
name               sravanmanojadityabhanumanoj
Maths_marks                                434
Chemistry_marks                            427
telugu_marks                               464
hindi_marks                                409
social_marks                               441
dtype: object

In [34]:
dataframe.count()

id                 5
name               5
Maths_marks        5
Chemistry_marks    5
telugu_marks       5
hindi_marks        5
social_marks       5
dtype: int64

In [35]:
dataframe.drop(columns=["name"]).std()

id                 2557.441397
Maths_marks          15.674821
Chemistry_marks      20.354361
telugu_marks          8.584870
hindi_marks          19.227584
social_marks          9.311283
dtype: float64

In [36]:
dataframe.drop(columns=["name"]).var()

id                 6540506.5
Maths_marks            245.7
Chemistry_marks        414.3
telugu_marks            73.7
hindi_marks            369.7
social_marks            86.7
dtype: float64

In [37]:
dataframe.groupby("name").first()

,id,Maths_marks,Chemistry_marks,telugu_marks,hindi_marks,social_marks
name,,,,,,
aditya,7014,88,99,88,56,78
bhanu,7033,90,90,80,67,90
manoj,4511,97,99,97,97,97
sravan,7058,99,89,99,99,79

In [38]:
dataframe.groupby("name")["social_marks"].sum()

name
aditya     78
bhanu      90
manoj     194
sravan     79
Name: social_marks, dtype: int64

In [39]:
dataframe.groupby("name")["Maths_marks"].count()

name
aditya    1
bhanu     1
manoj     2
sravan    1
Name: Maths_marks, dtype: int64

In [40]:
dataframe.groupby("name")["Maths_marks"]